[
    "I rang twice at his\n   door, but there was no reply, and I came home. I have no home left. I will encumber you no more. May\n   you, in your just resentment, be able to forget the\n   unworthy woman on whom you have wasted a most generous\n   devotion--who avoids you only with a deeper shame than\n   that with which she hurries from herself--and who writes\n   this last adieu. She veils and dresses quickly, leaves all her jewels and her money,\nlistens, goes downstairs at a moment when the hall is empty, opens\nand shuts the great door, flutters away in the shrill frosty wind.\n\n\"Hardly remembered me?\" \"I mean: how shall I explain? I--it's always so. EACH TIME YOU HAPPEN\nTO ME ALL OVER AGAIN.\" \"Oh, yes: I know! I know!\" \"Does it--do I too: to you?\" he insisted. She nodded, looking out of the window. \"Ellen--Ellen--Ellen!\" She made no answer, and he sat in silence, watching her profile grow\nindistinct against the snow-streaked dusk beyond the window. What had\nshe been doing in all those four long months, he wondered? How little\nthey knew of each other, after all! The precious moments were slipping\naway, but he had forgotten everything that he had meant to say to her\nand could only helplessly brood on the mystery of their remoteness and\ntheir proximity, which seemed to be symbolised by the fact of their\nsitting so close to each other, and yet being unable to see each\nother's faces. \"What a pretty carriage! Is it May's?\" she asked, suddenly turning her\nface from the window. \"Yes.\" \"It was May who sent you to fetch me, then? How kind of her!\" He made no answer for a moment; then he said explosively:  \"Your\nhusband's secretary came to see me the day after we met in Boston.\" In his brief letter to her he had made no allusion to M. Riviere's\nvisit, and his intention had been to bury the incident in his bosom. But her reminder that they were in his wife's carriage provoked him to\nan impulse of retaliation. He would see if she liked his reference to\nRiviere any better than he liked hers to May! As on certain other\noccasions when he had expected to shake her out of her usual composure,\nshe betrayed no sign of surprise: and at once he concluded:  \"He writes\nto her, then.\" \"M. Riviere went to see you?\" \"Yes: didn't you know?\" \"No,\" she answered simply. \"And you're not surprised?\" She hesitated."
]